# 상근이는 요즘 설탕공장에서 설탕을 배달하고 있다. 
# 상근이는 지금 사탕가게에 설탕을 정확하게 N킬로그램을 배달해야 한다. 
# 설탕공장에서 만드는 설탕은 봉지에 담겨져 있다. 봉지는 3킬로그램 봉지와 5킬로그램 봉지가 있다.
# 상근이는 귀찮기 때문에, 최대한 적은 봉지를 들고 가려고 한다. 
# 예를 들어, 18킬로그램 설탕을 배달해야 할 때, 3킬로그램 봉지 6개를 가져가도 되지만, 
# 5킬로그램 3개와 3킬로그램 1개를 배달하면, 더 적은 개수의 봉지를 배달할 수 있다.
# 상근이가 설탕을 정확하게 N킬로그램 배달해야 할 때, 봉지 몇 개를 가져가면 되는지 그 수를 구하는 프로그램을 작성하시오.


# 내 풀이 (틀림)
# n = int(input())
# count = 0

# while n >= 3:
#     if n >= 5 and (n % 5 == 0 or (n % 5) % 3 == 0 or (n-5) % 3 == 0 or (n-10) % 3 == 0):
#         n -= 5
#         count += 1
#     elif n % 3 == 0:
#         n -= 3
#         count += 1
#     else:
#         count = -1
#         break

# print(count)

# 답안(5의 배수면 나누고, 아닐 땐 n에 -3을 계속하면서 0보다 작으면 -1 출력-> 모든 경우의 수 가능)
n = int(input())
box = 0

while True:
    if n % 5 == 0:
        box += n // 5
        print(box)
        break
    n -= 3
    box += 1
    if n < 0:
        print(-1)
        break

    